const words = [
  "ヴェルギリウス", "カロン", "ダンテ", "イサン", "ファウスト", "ドン・キホーテ", "良秀", "ムルソー", "ホンル", "ヒースクリフ",
  "イシュメール", "ロージャ", "シンクレア", "ウーティス", "グレゴール",
  "エピ", "ソード",
  "ユーリ", "アヤ", "ホプキンス", "アレックス",
  "(老衰した)旧G社部長", "口の悪い残骸兵", "粗野な残骸兵", "トーマ",
  "豹", "獅子", "狼",
  "ヘルマン", "クボ", "ガファン",
  "質屋の主人",
  "強く見られたかったぽんぽん派の組織員", "田舎臭いぽんぽん派の組織員", "ぽんぽん派 ボス",
  "カジノ客", "身なりの整ったカジノ警備員", "カジノ警備員隊長",
  "陽気なマリアッチの組織員", "嗚咽するマリアッチの組織員", "アイド",
  "威圧的な鉄工会の組織員", "身体を解す鉄工会の組織員", "鉄工会 ボス",
  "ソーニャ",
  "借金まみれの人質", "お前ぶたれたい？しこたま？",
  "悪徳税金収集者",
  "検問所の職員", "子供", "ジークフリート",
  "異端審問官", "グイド", "クローマー",
  "デミアン",
  "鶏頭のK社検問所要員",
  "サムジョ", "菩薩チキン 社長", "ウンボンのチキン酒場 社長", "社長の母","四つ足の獣","全てある異端審問官","憤怒大罪", "傲慢大罪", "色欲大罪", "怠惰大罪", "暴食大罪", "憂鬱大罪", "嫉妬大罪",
    "ひもじいゴロツキ", "数を数えるゴロツキ", "鋭いゴロツキ", "ゴロツキのおかしら",
    "くたびれた残敗兵", "怪訝そうな残敗兵", "怒った残敗兵", "粗野な残敗兵", "口の悪い残敗兵", "刺ヶしい残敗兵", "強くなった残敗兵", "強烈になった残敗兵", "惓しくなった残敗兵", "元G社部長", "記憶の中の歪んだ敗残兵", "記憶の中の絶望する敗残兵", "記憶の中の侵食された敗残兵", "記憶の中の潰されたG社の部長",
    "黒檀女王の林檎", "終末土偶", "終末カレンダー", "黄金色の林檎 (偽物の林檎)",
    "強く見られたかったぽんぽん派の組織員", "ポン菓子が嫌いなぽんぽん派の組織員", "田舎訛りのぽんぽん派の組織員", "ぽんぽん派 ボス",
    "身なりの整ったカジノ警備員", "自身ありげなカジノ警備員", "決心するカジノ警備員", "カジノ警備員 隊長",
    "陽気なマリアッチの組織員", "軽快なマリアッチの組織員", "アイド",
    "身体を解す鉄工会の組織員", "威圧的な鉄工会の組織員",
    "奴隷",
    "強くなった？ほんとに？", "強くなったよ！マジで？", "お前ぶたれた？しこたま？",
    "誘惑する桃色の靴", "虜になった桃色の靴", "カツカツ？あるけ！",
"凍りゆく鉱山の奴隷", "寒がる鉱山の奴隷", "再び起き上がった隣人", "眠りから目覚めた隣人",
"バーバヤーガ",
"落ち着いたK社検問所要員", "無口なK社検問所要員", "生真面目なK社検問所要員", "心強いK社検問所要員",
"崇めるN社異端審問官", "従うN社異端審問官", "仕えるN社異端審問官", "拷問するN社異端審問官", "審問に長けたN社異端審問官", "執着するN社異端審問官", "無上の喜びに浸るN社異端審問官", "苦痛を楽しむN社異端審問官", "恐れの無いN社異端審問官", "執念のグイド",
"進もうとする異端審問官", "全てのある異端審問官", "這い回る異端審問官", "四つ足の獣", "蠢く異端審問官",
"クローマー", "完全な人間を夢見るクローマー",
"紅炎蛾", "鉄の螺旋", "叫喚する灰霧", "強制献血", "哭く棺桶", "戦羽鶴", "手招く陽光", "痛がるテディ", "皮膚の記録", "大きな狐", "木偶のお守り", "燃え渇く大角", "妖精大王", "天の執行官の補佐", "張付け掲示板", "歩く真珠", "白い手招き", "いない乗客", "がらんどう", "怨念の枝", "向けられた銃", "誰かの天国", "青い", "青い星", "結婚蜘蛛", "転搬の真空管", "夢見る電気羊", "電気百足", "私だけの遊び", "塔右饒", "妖精提灯", "燃え尽きた少女", "桃色の靴", "バジリスープク",
"断首魚", "路地の番犬", "泣きヒキガエル", "kqe-1j-23", "(町の住民の心臓)", "我、無に至れり",
"K社3級職員", "K社3級職員 - 強化", "導かれたの爛れたG社の部長", "導かれたアイド", "導かれたグイド",
"混乱しているK社検問所要員", "忙しないK社検問所要員", "目を回したK社検問所要員", "目の前が真っ暗なK社検問所要員",
"チキン野郎 - a.k.a ボンちゃん", "ボンちゃんパパ", "辛くなったボンちゃんパパ",
"屈折した路地の番犬", "屈折した断首魚"
];
const randomWordElement = document.getElementById("random-word");
const generateBtn = document.getElementById("generate-btn");

function generateRandomWord() {
  const randomIndex = Math.floor(Math.random() * words.length);
  randomWordElement.textContent = words[randomIndex];
}

generateBtn.addEventListener("click", generateRandomWord);